app/controllers/sessions_controller.rb

	def create
		#complete this method
		@user = User.where(email: params[:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]